Repository: Salahhossam/VoNinja
Catalog: lib/l10n/intl_*.arb
Languages: ar

# ug_8_body
source: After finishing Bronze + Silver + Gold boxes and reaching 25,000 points, you can request a 100 EGP cashout by entering your wallet number in the transfer screen. Your points then reset to 0 so you can re-enter Voninja Treasures and start the cycle again.
ar: بعد إنهاء الصناديق البرونزية والفضية والذهبية والوصول إلى 25,000 نقطة، يمكنك طلب تحويل 100 جنيه بإدخال رقم المحفظة في شاشة التحويل. بعدها تُعاد نقاطك إلى 0 لتبدأ دورة جديدة وتفتح الصناديق مجددًا.

# ug_9_title
source: How do I get reward codes from social media?
ar: كيف أحصل على أكواد المكافآت من السوشيال؟

# ug_9_body
source: Follow our social pages for questions and giveaways. Winners receive a special code. Go to Settings → Social Media and enter your reward code to redeem.
ar: تابع صفحاتنا على وسائل التواصل لأسئلة وجوائز. يُرسل الكود للفائز. ادخل إلى الإعدادات ← وسائل التواصل الاجتماعي وأدخل رمز المكافأة لاسترداده.

# ug_image_alt_social
source: Social reward code example
ar: مثال على كود مكافأة من السوشيال

# ug_10_title
source: How do I cash out?
ar: ما هي طرق سحب المكافآت؟

# ug_10_body
source: Every 25,000 points = 100 EGP, processed within 24–48 hours after submitting a request. Go to Settings → “Get your coins now”, enter your wallet or a contact number, and track the transfer via the WhatsApp number listed under Technical Support. Cashouts are currently available for Egyptian wallets/numbers only, with plans to expand globally.
ar: كل 25,000 نقطة = 100 جنيه خلال 24–48 ساعة من تقديم الطلب. اذهب إلى الإعدادات ← "احصل على عملاتك الآن"، ثم أدخل رقم المحفظة أو رقم تواصل، ويمكنك متابعة التحويل عبر رقم الواتساب الموجود في الدعم الفني. التحويل متاح حاليًا للأرقام والمحافظ المصرية فقط مع خطة للتوسع لاحقًا.

# ug_image_alt_cashout
source: Cashout flow example
ar: مثال لمسار السحب والتحويل

# ug_11_title
source: Why choose Voninja?
ar: لماذا أختار فونينجا؟

# ug_11_body
source: Voninja combines fun learning with real incentives. Three lesson levels suit all learners; challenges, events, and treasure boxes keep you motivated; and points convert quickly into real rewards.
ar: لأنه يجمع بين متعة التعلم والتحفيز المالي. ثلاثة مستويات تناسب الجميع، والتحديات والأحداث والصناديق تحافظ على الحماس، والنقاط تتحول بسرعة إلى مكافآت حقيقية.
