Repository: Salahhossam/VoNinja
Catalog: lib/l10n/intl_*.arb
Languages: ar

# appTitle
source: Voninja
ar: فونينجا

# splashWord
source: Be Ninja In English Vocabulary!
ar: كن خبيرًا بارعًا في مفردات اللغة الإنجليزية!

source: Login
ar: تسجيل الدخول

source: Phone Number
ar: رقم الهاتف

# enterPhoneNumber
source: Please enter your Phone Number
ar: من فضلك أدخل رقم الهاتف

# enterEmail
source: Please enter your Email
ar: من فضلك أدخل البريد الإلكتروني

source: Password
ar: كلمة المرور

# enterPassword
source: Please enter the password
ar: من فضلك أدخل كلمة المرور

source: Remember me
ar: تذكرني

source: Forget Password?
ar: نسيت كلمة المرور؟

# resetPassword
source: Password reset link sent to email
ar: تم إرسال رابط إعادة تعيين كلمة المرور إلى البريد الإلكتروني

source: Wrong Reset Password
ar: كلمة المرور غير صحيحة

# enterEmailOrUserNameToReset
source: Enter your email to reset
ar: أدخل البريد الإلكتروني لإعادة التعيين

# loginButton
source: Login
ar: تسجيل الدخول

# noAccount
source: Don't have an account?
ar: ليس لديك حساب؟

source: Sign up
ar: سجل الآن

# wrongCredentials
source: Wrong email or password
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة

# exitPrompt
source: Press again to exit
ar: اضغط مرة أخرى للخروج

source: Register
ar: التسجيل

source: Frist Name
ar: الاسم الاول

source: Last Name
ar: الاسم الاخير

source: User Name
ar: اسم المستخدم

source: Email
ar: البريد الإلكتروني

# doNotMatch
source: Passwords do not match
ar: كلمات المرور غير متطابقة

source: Create Account
ar: إنشاء حساب

# alreadyHaveAccount
source: Already have an account?
ar: هل لديك حساب؟

# enterLabel
source: Please enter your {label}
ar: من فضلك أدخل {label}

source: Edit
ar: تعديل

# enterPasswordLabel
source: Please enter your {label}
ar: من فضلك أدخل {label}

source: Current Password
ar: كلمة المرور الحالية

source: New Password
ar: كلمة المرور الجديدة

source: Confirm Password
ar: تأكيد كلمة المرور

source: Save Changes
ar: حفظ التغييرات

source: Change Password
ar: تغيير كلمة المرور

source: Edit Profile
ar: تعديل الملف الشخصي

source: Edit Password
ar: تعديل كلمة المرور

# chooseAnAvatar
source: Choose Your Ninja
ar: اختر النينجا الخاص بك

source: Total Balance
ar: إجمالي الرصيد

source: EGP
ar: جنيه مصري

source: Social Media
ar: وسائل التواصل الاجتماعي

source: Follow us!
ar: تابعنا!

source: Switch icons
ar: تبديل الأيقونات

# getNewCoins
source: Get your coins now!
ar: احصل على عملاتك الآن!

# inviteFriend
source: Invite your friend
ar: ادع صديقك

source: Get Your Points!
ar: رصيدك ونقاطك

# WithdrawPoints
source: Withdrawing points reduces your overall ranking
ar: سحب النقاط يقلل من تصنيفك الإجمالي.

source: Total Points
ar: اجمالي النقاط

source: Cash
ar: الرصيد المتاح

# enterPhoneNumberToGetCash
source: Please enter the phone number associated with your device. We’ll send you all details to complete the payment process
ar: يرجى إدخال رقم الهاتف المرتبط بجهازك. سنرسل لك جميع التفاصيل لإتمام عملية الدفع.

source: Send Details
ar: إرسال التفاصيل

# enterFriendLink
source: Enter your friend link
ar: أدخل رابط صديقك

source: Get Points
ar: احصل علي هديتك

source: Language
ar: اللغة

source: Transaction
ar: المعاملات

# about
source: About Us
ar: معلومات عننا

source: Version
ar: الإصدار

source: Logout
ar: تسجيل الخروج

source: Enter your reward code
ar: أدخل رمز المكافأة الخاص بك

source: Follow our social media
ar: تابعنا على وسائل التواصل الاجتماعي

source: Please enter valid data
ar: الرجاء إدخال معلومات صحيحة

# validFristName
source: First name must be at least 2 characters
ar: يجب أن يتكون الاسم الأول من حرفين على الأقل

# validLastName
source: Last name must be at least 2 characters
ar: يجب أن يتكون الاسم الأخير من حرفين على الأقل

# minUserName
source: Username must be at least 3 characters long
ar: يجب أن يتكون اسم المستخدم من 3 أحرف على الأقل

# maxUserName
source: Username cannot exceed 20 characters
ar: لا يمكن أن يتجاوز اسم المستخدم 20 حرفًا

# validPhoneNumber
source: Enter a valid phone number (e.g., +1234567890 or 0123456789)
ar: أدخل رقم هاتف صالحًا (على سبيل المثال، +1234567890 أو 0123456789)

source: Leaderboard
ar: لوحة المتصدرين

source: Check VoNinja Events !
ar: تحقق من أحداث VoNinja!

# continueCollectingPoints
source: Continue collecting points to convert them into financial rewards
ar: استمر في جمع النقاط لتحويلها إلى مكافآت مالية

# levelNumber
source: Level {level}
ar: المستوى {level}

source: Hi
ar: مرحبًا

source: Points
ar: النقاط

source: Rank
ar: التصنيف

source: Progress
ar: التقدم

# exit
source: Press again to exit
ar: اضغط مرة أخرى للخروج

source: Challenges
ar: التحديات

# gainPointsChallenges
source: Gain points from special Vocab Challenges!
ar: احصل على النقاط من تحديات المفردات الخاصة!

# pointChallenges
source: + 1 point | - 1 point
ar: + 1 نقطة | - 1 نقطة

# taskNumber
source: Task
ar: المهمة

source: Tasks
ar: المهام

# minmaPoints
source: You must have {subscriptionCostPoints} points to enter this challenge
ar: يجب أن يكون لديك {subscriptionCostPoints} نقطة لدخول هذا التحدي

# placeNumber
source: Place
ar: المركز

# rankPointsNumber
source: pts
ar: نقاط

# firstPlace
source: 1st
ar: الأول

# secondPlace
source: 2nd
ar: الثاني

# thirdPlace
source: 3rd
ar: الثالث

# subscribeInChallenge
source: Subscribe Now
ar: اشترك الآن

source: Start Challenge
ar: ابدأ التحدي

source: Bring your Sword!
ar: حضر سيفك!

source: Next Task
ar: المهمة التالية

# topTen
source: Top 10
ar: افضل 10 مقاتلين!

source: You
ar: انت

source: Show Ranks
ar: اظهر الترتيب

source: Lessons
ar: الدروس

# lessonsLearningVocabulary
source: This is your first step in learning English vocabulary. Go on ninja!
ar: هذه هي خطوتك الأولى في تعلم مفردات اللغة الإنجليزية. استمر، يا نينجا!

# correctAnswerPoints
source: For each correct answer, you will earn points, but if you answer incorrectly, you will lose points
ar: لكل إجابة صحيحة، سوف تكسب نقاطًا

# lessonNumber
source: Lesson
ar: الدرس

# pointNumber
source: Point
ar: نقطة

# questionsNumber
source: Questions
ar: الأسئلة

source: Start Learning
ar: ابدأ التعلم

source: Start Exam
ar: ابدأ الامتحان

# successfullyPoints
source: You have Successfully Completed the lesson
ar: لقد أكملت الدرس بنجاح واكتسبت النقاط

source: pts
ar: نقطة

source: Back to home
ar: الصفحة الرئيسية

source: Back
ar: رجوع

source: View results
ar: عرض النتائج

source: No vocabularies available
ar: لا توجد مفردات متاحة

# continueExams
source: Continue
ar: استمر

# youAreAllSet
source: You're All Set!
ar: كل شيء جاهز!

source: You learned 30 new words Today...
ar: لقد تعلمت 30 كلمة جديدة اليوم...

# plus20Points
source: +10 Points
ar: 10 نقطة اضافية

source: Next Lesson
ar: الدرس التالي

source: Continue Learning
ar: استمر في التعلم

# successfullyCompleted
source: Congratulations!
ar: مبروك!

# allQuestionsAnswered
source: You have successfully completed all questions in this lesson
ar: لقد أتممت جميع أسئلة هذا الدرس بنجاح

# incompleteLesson
source: Lesson Incomplete
ar: الدرس غير مكتمل

# unansweredQuestionsTitle
source: Questions not answered:
ar: الأسئلة التي لم يتم الإجابة عليها:

# completeAllQuestions
source: You can return to complete these questions to improve your score
ar: يمكنك العودة لإكمال هذه الأسئلة لتحسين نتيجتك

source: Unanswered questions:
ar: الأسئلة غير المجابة:

# completePreviousLesson
source: Complete the previous lesson first
ar: أكمل الدرس السابق أولاً

# mustCompleteLesson
source: You must complete all questions in lesson {previousLessonTitle} before starting this lesson.
ar: يجب عليك إكمال جميع أسئلة الدرس {previousLessonTitle} قبل أن تبدأ هذا الدرس.

source: Okay
ar: حسناً

source: Go to previous lesson
ar: الذهاب للدرس السابق

source: Complete Previous Level
ar: أكمل المستوى السابق

# mustCompleteLevel
source: You must complete level {level} first to unlock this content
ar: يجب عليك إكمال المستوى {level} أولاً لفتح هذا المحتوى

# pleaseAnswerTheQuestionFirst
source: Please answer the current question before continuing.
ar: الرجاء الإجابة على السؤال الحالي قبل المتابعة.

source: Warning
ar: تحذير

# libraryTitle
source: Voninja Library
ar: مكتبة فونينجا

# librarySubtitle
source: Browse English learning books
ar: تصفح كتب تعلم الإنجليزية

source: Join Challenges & Earn Points
ar: انضم إلى التحديات واكسب النقاط

# completeDailyChallenges
source: Complete daily challenges to collect rewards
ar: أكمل التحديات اليومية لجمع المكافآت

source: View All Challenges
ar: عرض جميع التحديات

source: Discover Exciting Events
ar: اكتشف الأحداث المثيرة

# participateSpecialEvents
source: Participate in special events for exclusive rewards
ar: شارك في الأحداث الخاصة للحصول على مكافآت حصرية

source: View All Events
ar: عرض جميع الأحداث

source: Events
ar: الأحداث

source: No events available
ar: لا توجد أحداث متاحة

# startsIn
source: Starts in {time}
ar: يبدأ بعد {time}

# endsIn
source: Ends in {time}
ar: ينتهي بعد {time}

source: Not active yet
ar: غير نشط بعد

source: Ended
ar: انتهى

# correctAnswers
source: Correct answers: {current}/{goal}
ar: الإجابات الصحيحة: {current}/{goal}

# totalAnswers
source: Total answers: {current}/{total}
ar: إجمالي الإجابات: {current}/{total}

# points2
source: Points: {current}/{goal}
ar: النقاط: {current}/{goal}

# completedPercentage
source: {percentage}% completed
ar: تم إكمال {percentage}%

source: Join
ar: انضم

source: In progress
ar: قيد التقدم

source: Continue Quiz
ar: استمر في الاختبار

source: Claim Reward
ar: المطالبة بالمكافأة

source: Reward Claimed
ar: تم المطالبة بالمكافأة

# rewardClaimedMessage
source: Reward claimed!
ar: تم المطالبة بالمكافأة!

source: Error
ar: خطأ

# specialOfferTitle
source: Special Points Offer
ar: عرض نقاط خاص

# specialOfferBody
source: You can earn more points right now by visiting the Events page. There is also a Welcome Event that grants you extra bonus points on your first visit. Would you like to go now, or continue your exam?
ar: تستطيع جمع نقاط أكثر الآن عند زيارة صفحة الفعاليات. كما يوجد فعالية ترحيبية (Welcome Event) تمنحك نقاطًا إضافية في أول زيارة. هل تود الانتقال الآن أم تفضّل متابعة الامتحان؟

source: Go to Events
ar: اذهب إلى الفعاليات

source: Continue Exam
ar: متابعة الامتحان

# goodLuck
source: Good luck! Review your answers and try again in the next event.
ar: حظًا موفقًا! راجع إجاباتك وحاول مرة أخرى في الحدث القادم.

source: Show my answers
ar: عرض إجاباتي

source: Treasure Boxes
ar: صناديق الكنوز

source: Start New Cycle
ar: ابدأ دورة جديدة

# wantNewAdventure
source: 🎯 Want to start a new adventure?
ar: 🎯 عايز تبدأ مغامرة جديدة؟

# newCycleDescription
source: You can reset the cycle now and start with a reward of 500 points. Or continue as you are and keep your current points.
ar: بإمكانك إعادة الدورة دلوقتي وهتبدأ برصيد ٥٠٠ نقطة مكافأة. أو كمل زي ما إنت واحتفظ بنقاطك الحالية.

source: ⚠️ Important warning:
ar: ⚠️ تنبيه مهم:

# cycleWarning
source: If your balance exceeds 25,000 points, you must first make a transfer request to receive cash in your wallet within 48 working hours. Then you can start a new cycle with a 500 point reward. If your current points are more than 500, they will be replaced with only 500 points.
ar: لو رصيدك عدى ٢٥,٠٠٠ نقطة، لازم الأول تعمل طلب تحويل عشان تستلم الكاش في محفظتك خلال ٤٨ ساعة عمل و تقدر تبدأ دورة جديدة بـ ٥٠٠ نقطة مكافأة و لو نقاطك الحالية أكتر من ٥٠٠، هيتم استبدالها بـ ٥٠٠ نقطة فقط .

# confirmNewCycle
source: Confirm starting new cycle
ar: تأكيد بدء دورة جديدة

# confirmNewCycleDescription
source: By pressing "Confirm", a new cycle will begin and your balance will be reset to 500 points. We recommend using your existing points before starting a new cycle. ⚠️ If your balance is 25,000 points or more, you must submit a transfer request first.
ar: عند الضغط على "تأكيد"، سيتم بدء دورة جديدة وسيُعاد رصيدك إلى ٥٠٠ نقطة. ننصحك باستخدام نقاطك الحالية قبل البدء بدورة جديدة. ⚠️ في حال كان رصيدك ٢٥,٠٠٠ نقطة أو أكثر، يجب تقديم طلب تحويل أولًا.

source: Confirm
ar: تأكيد

# completeCurrentLevel
source: Complete the current level first
ar: أكمل المستوى الحالي أولًا

source: Your Points
ar: نقاطك

source: Cycle
ar: الدورة

source: Bronze
ar: برونزية

source: Silver
ar: فضية

source: Gold
ar: ذهبية

# adNotAvailable
source: Ad is not currently available, try again in a moment.
ar: الإعلان غير متاح حاليًا، حاول ثانيا بعد لحظات.

# cannotAccessLevel
source: You cannot access this level before completing the previous one.
ar: لا يمكنك دخول هذا المستوى قبل إنهاء السابق.

# needPoints
source: You need {points} additional points.
ar: تحتاج {points} نقطة إضافية.

# watchAds
source: Watch {ads} ad(s).
ar: شاهد {ads} إعلان/إعلانات.

# earnedPoints
source: You earned {points} points.
ar: حصلت على {points} نقطة.

# congratsAllBoxes
source: Congratulations! All boxes for cycle #{cycle} have been completed.
ar: أحسنت! اكتملت جميع الصناديق للدورة #{cycle}.

source: Complete all boxes first.
ar: أكمل كل الصناديق أولاً.

# newCycleStarted
source: New cycle started (#{cycle}). Good luck!
ar: تم بدء دورة جديدة (#{cycle}). بالتوفيق!

# treasureBoxesCard
source: Treasure Boxes
ar: صناديق الكنوز

# treasureBoxesLevels
source: Bronze • Silver • Gold
ar: برونزية • فضية • ذهبية

# boxNumber
source: #{number}
ar: رقم {number}

# rewardPoints
source: Reward + {points} pts
ar: مكافأة + {points} نقطة

# needPoints2
source: Need {current}/{required} pts
ar: تحتاج {current}/{required} نقطة

# needPointsRemaining
source: Need {current}/{required} pts
ar: تحتاج {current}/{required} نقطة

# adsProgress
source: Ads {current}/{required}
ar: إعلانات {current}/{required}

source: Watch Ad
ar: شاهد إعلان

source: Open
ar: افتح

source: 🎉 Congratulations
ar: 🎉 مبروك

source: OK
ar: تمام

# cannotStartNewCycle
source: Cannot start a new cycle
ar: لا يمكن بدء دورة جديدة

# mustTransferPointsFirst
source: Your balance is above 25,000 points. Please submit a transfer request first before starting a new cycle.
ar: رصيدك أكبر من ٢٥,٠٠٠ نقطة. يجب تقديم طلب تحويل النقاط أولًا قبل بدء دورة جديدة.

# intro_appBarTitle
source: Welcome Challenge Instructions
ar: تعليمات التحدي الترحيبي

# intro_title
source: Welcome to VoNinja! This is a welcome challenge:
ar: أهلاً بك في برنامج VoNinja! هذا تحدٍّ ترحيبي:

# intro_bullet_all_questions
source: Answer all the challenge questions.
ar: أجب عن جميع أسئلة التحدي.

# intro_bullet_five_minutes
source: You have only 5 minutes from the moment you start.
ar: لديك 5 دقائق فقط من لحظة البدء.

# intro_bullet_reward
source: If you answer all questions correctly before time runs out, you will earn 500 points!
ar: إن أجبت على كل الأسئلة بشكل صحيح قبل انتهاء الوقت، ستحصل على 500 نقطة!

# intro_startButton
source: Start Challenge
ar: ابدأ التحدي

# final_congrats_title
source: Congratulations!
ar: مبروك!

# final_congrats_desc
source: You finished all questions correctly within {minutes} minutes. 500 points have been added to your balance.
ar: أنهيت كل الأسئلة بشكل صحيح خلال {minutes} دقيقة. تم إضافة 500 نقطة إلى رصيدك.

# final_tryAgain_title
source: Better luck next time
ar: حظ أوفر في المرة القادمة

# final_tryAgain_desc_inTimeWrong
source: You finished before time, but some answers were incorrect. Try again!
ar: أتممت قبل انتهاء الوقت، لكن توجد إجابات غير صحيحة. حاول مرة أخرى!

# final_tryAgain_desc_timeOver
source: Time ended before completing all answers correctly. Try again!
ar: انتهى الوقت قبل إكمال كل الإجابات بشكل صحيح. حاول مرة أخرى!

# final_ok
source: OK
ar: تم

# nav_home
source: Home
ar: الرئيسية

# nav_challenges
source: Challenges
ar: التحديات

# nav_leaderboard
source: Leaderboard
ar: لوحة الصدارة

# nav_treasure
source: Treasures
ar: الكنوز

# nav_settings
source: Settings
ar: الإعدادات

# select_tap_error
source: Could not switch tab
ar: تعذّر التبديل بين الألسنة

# nav_learn
source: Learn
ar: التعلم

source: Locked
ar: مقفول

source: About Us
ar: من نحن

source: Technical Support
ar: الدعم الفني

# about_title
source: 📖 About Voninja
ar: 📖 حول Voninja

# about_intro_1
source: Voninja is an innovative learning app for mastering English words and vocabulary in a fun, interactive way.
ar: Voninja هو تطبيق تعليمي مبتكر لتعلم كلمات ومفردات اللغة الإنجليزية بطريقة ممتعة وتفاعلية.

# about_intro_2
source: It combines learning + challenges + real rewards to make your learning experience engaging and exciting.
ar: بيجمع ما بين التعلم + التحديات + المكافآت المادية علشان يخلي تجربة التعلم مختلفة ومشوقة.

# features_title
source: Voninja Features:
ar: مميزات Voninja:

# feature_interactive_lessons
source: 🎯 Interactive lessons: learn new words through short, easy questions.
ar: 🎯 دروس تفاعلية: تتعلم كلمات جديدة من خلال أسئلة قصيرة وسهلة.

# feature_challenges
source: 🏆 Challenges: tasks with specific points to keep you progressing step by step.
ar: 🏆 Challenges: مهام مختلفة بنقاط محددة علشان تحفزك تتقدم خطوة بخطوة.

# feature_library
source: 📚 Voninja Library: a collection of PDF files to expand your vocabulary.
ar: 📚 Voninja Library: مكتبة تعليمية تحتوي على ملفات PDF متنوعة تساعدك على توسيع حصيلتك اللغوية.

# feature_treasure
source: 🎁 Treasure Boxes Page: progressive boxes (Bronze – Silver – Gold) that unlock gradually and reward you with points and gifts.
ar: 🎁 نظام الصناديق (Treasure Boxes Page): صفحة خاصة فيها صناديق متدرجة المستويات (Bronze – Silver – Gold) تفتح تدريجيًا وتكافئك بنقاط وهدايا.

# feature_events
source: 📅 Special Events: time-limited events that boost your engagement and unlock big rewards.
ar: 📅 Events مميزة: فعاليات محدودة الوقت بتشجعك تتفاعل بشكل أكبر وتحصل على جوائز ضخمة.

# rewards_title
source: Rewards System:
ar: نظام المكافآت:

# rewards_intro
source: With Voninja, every point you learn has real value 💰
ar: مع Voninja، كل نقطة بتتعلمها ليها قيمة حقيقية 💰

# rewards_cash
source: When you collect 25,000 points, you can convert them directly to 100 EGP cash.
ar: عند تجميع 25,000 نقطة، تقدر تحولهم مباشرة إلى 100 جنيه كاش.

# rewards_time
source: If you use the app for two hours daily, you can reach 25,000 points in a short period of only 3–5 days.
ar: في حالة استخدام التطبيق ساعتين يوميًا، هتقدر توصل لـ 25,000 نقطة في فترة قصيرة من 3 لـ 5 أيام فقط.

# goal_title
source: Our Goal:
ar: هدفنا:

# goal_body
source: Make learning English easy, enjoyable, and financially rewarding at the same time. With Voninja, every minute you learn brings you closer to your language goal—and helps you earn extra income from your effort.
ar: نخلي تعلم اللغة الإنجليزية عملية سهلة، ممتعة، ومربحة ماديًا في نفس الوقت. مع Voninja، كل دقيقة بتتعلم فيها بتقربك من تحقيق هدفك في اللغة، وفي نفس الوقت بتحقق دخل إضافي من مجهودك.

# support_title
source: 🛠️ Technical Support
ar: 🛠️ الدعم الفني

# support_intro
source: If you face any issue or have a question about using Voninja, our support team is ready to help anytime.
ar: لو واجهتك أي مشكلة أو عندك استفسار بخصوص استخدام Voninja، فريق الدعم الفني جاهز يساعدك في أي وقت.

# support_email_label
source: Support Email
ar: البريد الإلكتروني للدعم

# support_whatsapp_label
source: WhatsApp Support
ar: واتساب الدعم

# support_note
source: You can contact us at any time, and our team will get back to you as soon as possible to solve your problem or answer your questions.
ar: تقدر تتواصل معانا في أي وقت، وهتلاقي فريقنا بيرد عليك في أسرع وقت علشان يحل مشكلتك أو يجاوب على أسئلتك.

# faq_title
source: Frequently Asked Questions
ar: الأسئلة الشائعة

# faq_q1
source: How fast do you respond?
ar: في خلال قد إيه بتردوا؟

# faq_a1
source: We usually reply within a few hours. During events and peak times, it may take a little longer.
ar: عادةً بنرد خلال ساعات قليلة، وأثناء الفعاليات أو الضغط ممكن يتأخر الرد قليلًا.

# faq_q2
source: What info should I include in my message?
ar: إيه المعلومات اللي أبعتهالكم؟

# faq_a2
source: Please share your device type, app version, and a brief description or a screenshot of the issue.
ar: من فضلك اذكر نوع جهازك، إصدار التطبيق، ووصف مختصر أو لقطة شاشة للمشكلة.

# faq_q3
source: Can I contact you outside business hours?
ar: هل أقدر أتواصل خارج أوقات العمل؟

# faq_a3
source: Yes, messages are accepted 24/7. Our team will get back to you in the next available window.
ar: نعم، نرحب بالرسائل 24/7 وسنعاود التواصل في أول نافذة مناسبة.

source: Copied
ar: تم النسخ

source: Copy
ar: نسخ

source: User Guide
ar: دليل المستخدم

# userGuide_headerTitle
source: Voninja — Learn & Earn
ar: فونينجا — تعلم واربح

# userGuide_headerSubtitle
source: Short lessons, quizzes, challenges, treasure boxes, and real cash rewards.
ar: دروس قصيرة، اختبارات، تحديات، صناديق كنوز، ومكافآت مالية حقيقية.

# ug_1_title
source: What is Voninja?
ar: ما هو تطبيق فونينجا؟

# ug_1_body
source: Voninja is an interactive learning app for English using short lessons, quizzes, challenges, and a points system. Every learning activity grants points that can be converted into real cash rewards.
ar: فونينجا تطبيق تعلّم تفاعلي للغة الإنجليزية قائم على الدروس القصيرة والاختبارات والتحديات ونظام النقاط. كل نشاط تعليمي يمنحك نقاطًا يمكن تحويلها إلى مكافآت مالية حقيقية.

# ug_2_title
source: What levels are available?
ar: ما هي المستويات المتاحة؟

# ug_2_body
source: The app offers three learning levels: • Basic: each lesson = 1 point. • Intermediate: each lesson = 2 points. • Advanced: each lesson = 3 points. After every lesson, a short quiz evaluates your recall and adds points automatically.
ar: يوفر التطبيق ثلاثة مستويات: • Basic (أساسي): كل درس = نقطة واحدة. • Intermediate (متوسط): كل درس = نقطتان. • Advanced (متقدم): كل درس = ثلاث نقاط. بعد كل درس يوجد اختبار قصير لتقييم الحفظ وإضافة النقاط تلقائيًا.

# ug_3_title
source: What are "Challenges"?
ar: ما هي "التحديات"؟

# ug_3_body
source: Challenges are multi-question tasks. Each correct answer can grant 3, 5, 10, 20, 25 points or more. To join a challenge, you must meet the entry requirement (e.g., have 2,000 points).
ar: التحديات مهام متعددة الأسئلة؛ كل إجابة صحيحة قد تمنح 3 أو 5 أو 10 أو 20 أو 25 نقطة أو أكثر. للدخول يلزم توفر شرط نقاط معين (مثال: امتلاك 2000 نقطة).

# ug_4_title
source: What are "Events"?
ar: ما هي "الأحداث"؟

# ug_4_body
source: Time-limited events that grant extra rewards, such as: • Double Points Day: all points earned double for 24 hours. • Kickstart Challenge: earn 1,000 points in your first 48 hours to get +3,000 points. • Quiz Master 100: answer 100 questions correctly within 48 hours to get +1,000 points.
ar: فعاليات محدودة المدة بمكافآت إضافية، مثل: • Double Points Day: تتضاعف نقاطك لمدة 24 ساعة. • Kickstart Challenge: اجمع 1000 نقطة خلال أول 48 ساعة لتحصل على 3000 نقطة إضافية. • Quiz Master 100: أجب 100 سؤالًا بشكل صحيح خلال 48 ساعة لتحصل على 1000 نقطة.

# ug_5_title
source: How do Treasure Boxes work?
ar: كيف يعمل نظام صناديق الكنوز؟

# ug_5_body
source: Voninja Treasures include Bronze, Silver, and Gold boxes. Each box requires a minimum points balance and ad views to enter, and grants increasing point rewards.
ar: تشمل Voninja Treasures صناديق Bronze وSilver وGold. لكل صندوق شرط دخول بعدد نقاط ومشاهدة إعلانات، ويمنح مكافآت نقاط متصاعدة.

# ug_6_title
source: Can I boost points with ads?
ar: هل يمكن مضاعفة النقاط بالإعلانات؟

# ug_6_body
source: Yes. Watch a short ad to get +10 extra points, or claim bonus points after each quiz via a rewarded ad.
ar: نعم. يمكنك مشاهدة إعلان قصير للحصول على +10 نقاط إضافية، أو إضافة نقاط بعد كل اختبار عبر إعلان مكافأة.

# ug_7_title
source: What is the Voninja Library?
ar: ما هي مكتبة فونينجا؟

# ug_7_body
source: An in-app library of educational PDF books. You can unlock and read books directly after paying with points.
ar: مكتبة داخل التطبيق تضم كتب PDF تعليمية متنوعة. تستطيع فتح الكتب وقراءتها مباشرة بعد الدفع بالنقاط.

# ug_8_title
source: How does the "Treasure Recycle" work?
ar: كيف تعمل إعادة الدورة في الكنوز؟
